/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：输入一字符串，检查字符串是否满足以下条件：
     （1）字符串s中左括号“(”的个数与右括号“)”的个数相
          同；
     （2）从字符串s的首字符起顺序查找右括号“)”的个数在
          任何时候均不超过所遇到的左括号“(”的个数。若字
          符串同时满足上述两个条件，函数返回1，否则返回0。
---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
void main()
{
    int fun(char s[]);
    char s[80];
    int c;
    printf("Please input the string:");
    gets(s);
    c=fun(s);
    printf("c=%d\n",c);
}
int fun(char s[])
{
    int c1,c2,i;
    i=c1=c2=0;
    while(s[i]!='\0')
    {
        if(s[i]=='(') c1++;
        else if(s[i]==')')
        { 
            c2++;
/***********SPACE***********/
            if(【?】) return(0);
        }
        i++;
    }
/***********SPACE***********/
    return(【?】);
}