/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------
题目：下列给定程序中，函数fun的功能是：求出数组中的最大数和次最大数，并把最
      大数和a[0]中的数对调、次最大数和 a[1] 中的数对调。
-------------------------------------------------------*/
#include   <conio.h>
#include   <stdio.h>
#define    N   20
/***********FOUND***********/
void fun(int a,int n);
{
        int  i,  m, t, k;
        for(i=0; i<2;i++)
        {
/***********FOUND***********/
                m=0;
                for(k=i+1; k<n; k++)
                        if(a[k]>a[m])
                                m=k;
                        t=a[i];
                        a[i]=a[m];
                        a[m]=t;
        }
}
main()
{ 
        int b[N]={11,5,12,0,3,6,9,7,10,8},n=10,i;
        system("CLS");
        for(i=0; i<n; i++)  
                printf("%d ",b[i]);
        printf("\n");
        fun(b,n);
        for(i=0; i<n; i++)  
                printf("%d ", b[i]);
        printf("\n");
}