/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：函数fun的功能是：统计长整数n的各位上出现数字1、2、3的次数，并用
      外部(全局)变量c1、c2、c3返回主函数。
例如：当n＝123114350时，结果应该为：c1＝3  c2＝1  c3＝2。
-------------------------------------------------------*/
#include <stdio.h>
int c1, c2, c3;
void fun(long n)
{
        c1=c2=c3=0;
        while(n)
        {
/***********SPACE***********/
                switch(【?】)
                {
                        case 1:
/***********SPACE***********/
                                c1++;【?】;
                        case 2:
/***********SPACE***********/
                                c2++;【?】;
                        case 3: 
                                c3++;
                }
                n/=10;
        }
}
main()
{
        long n=123114350L;
        fun(n);
        printf("\nThe result: \n");
        printf("n=%ld c1=%d c2=%d c3=%d\n",n,c1,c2,c3); 
}