# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：判断完全数、丰沛数、不足数

描述：编写程序，从键盘输入一个整数并判断该数的类别。

提示：其因数之和等于数字本身的数称为完全数，比数字本身大的数称为丰沛数，比数字本身小的数称为不足数。

要求：

     输入格式：输入一个整数。


     输出格式：输出这个数的类别。


      输入示例    输出示例

 示例1   25       25是不足数
 示例2   6        6是完全数
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********




#**********  End  **********
