/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：函数fun的功能是：计算如“图片1”的前n项。
      若x＝2.5，函数值为12.182340。
-------------------------------------------------------*/
#include    <stdio.h>
double fun(double  x, int  n)
{  
        double  f, t;   
        int  i;
        f = 1.0;
/***********SPACE***********/
        t=【?】;
/***********SPACE***********/
        for(i=【?】;i<n;i++)
        {
/***********SPACE***********/
                t*=x/【?】;
                f += t;
        }
        return  f;
}
main()
{  
        double  x, y;
        x=2.5;
        y = fun(x, 12);
        printf("\nThe result is :\n");
        printf("x=%-12.6f     y=%-12.6f\n", x, y);
}