/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：找出矩阵x前n行中的最大整数，用该整数所生产的降序数
      将其替换。降序数是指该数的高位数字的值不小于低位数
      字的值。例如，若矩阵中的最大整数是1024，则用4210替
      换1024。
      例如，矩阵x 为：        
          456   44    674         
          789   324   1024        
          213   345   537 
      则替换后的矩阵为：
          456   44    674
          789   324   4210
          213   345   537
---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/
#include<stdio.h>
void main()
{
    void matrix_change(int x[][3],int n);
    int a[3][3]={456,44,674,789,324,1024,213,345,537},i,j;
    printf("The result is:\n");
    matrix_change(a,2);
    for(i=0;i<3;i++)
    {   
        for(j=0;j<3;j++) printf("%5d",a[i][j]);
        printf("\n");     
    }
}
void matrix_change(int x[][3],int n)
{
    int i,j,k,t[5]={0},max,maxi,maxj,v;
    max=x[0][0];maxi=maxj=0;
    for(i=0;i<n;i++)
        for(j=0;j<3;j++)
            if(x[i][j]>max) {max=x[i][j];maxi=i;maxj=j;}
    k=0;
    while(max>0)
/*******************SPACE*******************/
    {  t[【?】]=max%10;max=max/10;  }
    for(i=0;i<k;i++)
/*******************SPACE*******************/
        for(j=0; j<【?】;j++)
            if(t[j]<t[j+1]) {v=t[j];t[j]=t[j+1];t[j+1]=v;}
    for(i=0;i<k;i++)
        max=max*10+t[i];
    x[maxi][maxj]=max;
}