/*---------------------------------------------------------------
【程序设计】
-----------------------------------------------------------------
题目：编写一个判断素数的函数，函数原型为 int isprime(int n);若n为
      素数函数返回值为1，否则返回值为0；主函数中调用该函数，输出
      100---200之间所有的素数，并计算所有素数的和。
-----------------------------------------------------------------*/
#include"math.h"
#include "stdio.h"
void main( )
{ 
    int m ,s=0,flag;   
    int isprime(int n);
    for(m=100;m<200;m++)
    {
        flag=isprime(m);
        if(flag)
        {  printf("%4d ",m);s+=m;}
    }                   
   printf("\n%4d",s);      
}
int isprime(int n)       
{ 
    int i,k;        
    /**********Program**********/
    /**********  End  **********/
}