/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：蛋糕店圆柱状单层蛋糕按照表面积大小出售，价格就是表面积。因为碰上六一节，
      价格打六折。请编写程序：输入r表示蛋糕的半径， h表示蛋糕的高度，输出所出
      售蛋糕的价格（结果保留 2 位小数）。价格公式如样张所示。
      如输入6  2， 输出180.96。
--------------------------------------------------------------------------
注意：请勿改动Program-End标志行之外的内容，仅在标志行之间填写代码。
      不要删除标志行，否则不得分！
-------------------------------------------------------------------------*/
#include<stdio.h>
#define PI 3.1415926
int main()
{
    int r,h;
    double m;
    scanf("%d%d",&r,&h);
    /**********Program**********/  
    /**********  End  **********/
    printf("价格是%.2f\n",m);
    return 0;
}