/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：下列给定程序中，函数fun的功能是计算下式如"图片1"直到
       如"图片2"，并将计算结果作为函数值返回。   
例如：若形参e的值为1e-3，函数的返回值为2.985678。 
-------------------------------------------------------*/
#include  <stdio.h>
double fun(double  e)
{ 
        int  i;  
        double  s, x;
        s=0; 
/***********SPACE***********/
        i=【?】;
        x=1.0;
        while(x>e)
        {
/***********SPACE***********/
                【?】;
/***********SPACE***********/
                x=(2.0*i-1)/(【?】);
/***********SPACE***********/
                s=s+【?】;
        }
/***********SPACE***********/
        return  【?】;
}
main()
{ 
        double  e=1e-3;
        printf("\nThe result is: %f\n",fun(e));
}