/*------------------------------------------------
【程序设计】
--------------------------------------------------
功能：求一组数中大于平均值的数的个数。
例如：给定的一组数为1,3,6,9,4,23,35,67,12,88时，函
数值为3。
------------------------------------------------*/
#include <stdio.h>
int fun(int a[],int n)
{   int sum=0,k;
    Float aver;
    for(i=1;i<10;i++)
        sum+=a[i];
    aver=sum/9;
    printf(“%f”,aver);
    for(i=0;i<10;i++)
        if(a[i]>aver)
        k++;
    return k
/**********Program**********/
//要求：用for，循环变量用i,平均值用ave，个数统计用k，和用s
/**********  End  **********/
}
main()
{
    int a[10]={1,3,6,9,4,23,35,67,12,88};
    int y;
    y=fun(a,10);
    printf("y=%d\n",y);
}