/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------
题目：fun函数的功能是：先从键盘上输入一个3行3列矩阵的各
      个元素的值，然后输出主对角线上的元素之和sum。
      请改正程序中的错误，使它能得出正确的结果。
--------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------*/
#include "stdio.h"
int fun()
{
  int a[3][3],sum;
  int i,j;
  sum=0;
  for(i=0;i<3;i++)
    for(j=0;j<3;j++)
      scanf("%d",&a[i][j]);
  for(i=0;i<3;i++)
/**********FOUND**********/
    sum=sum+a[i][j];
/**********FOUND**********/
  printf("sum=%f\n",sum);
}
main()
{
 fun();
}