/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：给定程序中，函数fun的功能是：调用随机函数产生20个互不相同的整数
      放在形参a所指数组中(此数组在主函数中已置0)。
-------------------------------------------------------*/
#include  <stdlib.h>
#include  <stdio.h>
#define   N  20
void  fun( int  *a)
{ 
        int  i, x, j=0;
        x=rand()%20;
/***********SPACE***********/
        while (j<【?】)
        {  
                for(i=0; i<j; i++ )
                        if( x==a[i] ) 
/***********SPACE***********/
                                【?】;
/***********SPACE***********/
                if( i==【?】)
                { 
                        a[j]=x; 
                        j++; 
                }
                x=rand()%20;
        }
}
main()
{ 
        int  x[N]={0} ,i;
        fun( x );
        printf("The result :  \n");
        for( i=0; i<N; i++ )
        {
                printf("%4d",x[i]);
                if((i+1)%5==0)
                        printf("\n");
        }
        printf("\n\n");
}