'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：一个整数，它加上100后是一个完全平方数，再加上168又
     是一个完全平方数，请问该数是多少？
     请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def main():       
    t = []
    #*****************FOUND**************** 
    for m in range(168)
        for n in range(m):
            #****************FOUND ***************
            if m**2 - n**2 = 168
                #*************FOUND **************
                x = n*2 - 100
                t.append(x)
    print('符合条件的整数有：',t )
   
if __name__ == '__main__':
    main()