# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写判断一个数是否为素数的函数，然后编写测试代码，
      判断并输出2~100中的素数个数。

说明：补充完整IsPrime函数，其中给定flag变量为函数返回值
    
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def IsPrime(n):
    flag=0
#**********Program**********




#**********end**********

def main():
    count=0
    for n in range(2,100):
        if IsPrime(n)==0:
            count=count+1
    print(count)
                
if __name__ == '__main__':
    main() 
