# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------
由Monday~Sunday（代表星期一到星期日）的7个值组成的字典，输出键列表、值列表及
键值列表
------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
d={"sunday":"星期日","monday":"星期一","tuesday":"星期二","wednesday":"星期三",
"thursday":"星期四","friday":"星期五","saturday":"星期六" }
print(d)
#**********SPACE**********
print(d.【?】)
#**********SPACE**********
print(d.【?】)
print(d.items())
k=list(d)
for i in k:
     print(i,d.get(i))