# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入字符串a和b，连接两个字符串a和b并输出。

说明：字符串a和b从键盘输入。
输出示例：

【从键盘输入一个字符串a:】apple
【从键盘输入第二个字符串b:】school
字符串a连接字符串b appleschool
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********






#**********  End  **********
