# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：求100之内的素数。

---------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
import math

def is_prime(n):
#**********FOUND**********
    for i in range(1,math.sqrt(n)):
#**********FOUND**********
        if n//i==0:
            return False
    else:
        return True

def main():
#**********FOUND**********
    primes = [i for i in range(1,100) if is_prime(i)]
    print(primes)

if __name__ == '__main__':
    main()
