# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：删除列表中重复的元素

要求：使用while循环

---------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def main():
    li = [1,2,3,4,5,2,1,3,4,57,8,8,9]
    print("原列表：",li)   
    i = 0  #变量i是li的下标
#**********FOUND**********
    while i >= len(li):    
        j = i + 1
#**********FOUND**********
        while j <= len(li):   
            if li[i] == li[j]:
                del li[j]     
#**********FOUND**********
                break
            j = j + 1
        i = i + 1
    print("去除重复元素后的列表为：",li)    
            
if __name__ == '__main__':
    main()
