# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：计算矩形面积

描述：用户输入矩形的长和宽，计算其面积并输出，结果四舍五
      入，保留2位小数。

要求：

     输入格式：第一行输入一个数字，代表矩形的长
               第二行输入一个数字，代表矩形的宽

     输出格式：矩形的面积（保留两位小数）



      输入示例    输出示例

 示例1 5.899       26.94
       4.567
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********






#**********  End  **********
