# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，输出如下所示三角形图案。


        * 

      * * * 

    * * * * * 

  * * * * * * * 

* * * * * * * * *


要求：使用for循环的方式完成

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def main():
    for i in range(1,6):
        for j in range(5-i):
            print(" ",end=" ")  
    #**********Program**********



            
    #**********  End  **********  
if __name__ == '__main__':
    main()  
