# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：编写函数 fun(n)，返回值是布尔值，调用该函数判断一个整数是否为完数，并输出
      相应结论。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def fun(n):
#**********FOUND**********
    s=[]
    for i in range(1,n):
        if n%i==0:
            s+=i
    if n==s:
#**********FOUND**********
        return 0
    else:
        return False
n=eval(input())
if fun(n):
    print(n,'是完数')
else:
    print(n,'不是完数')