# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：Fibonacci数列

描述：编写程序，计算Fibonacci数列的前20项。



提示：Fibonacci数列的特点是，第一、二项的值都为1，从第三项开始，每项都是前两项之和。

要求：同一行的两个数字用“\t”隔开。

     输入格式：该题无输入。


     输出格式：如样例格式输出数列前20项。


     输出示例
     1        1
     2        3
     5        8
     13        21
     34        55
 
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********




#**********  End  **********
