# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：程序运行时从键盘输入10个学生的成绩，统计最高分、最低分和平均分。
      ma代表最高分，mi代表最低分。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
p=[]
for i in range(10):
    x=eval(input())
#**********FOUND**********
    p. insert(x)
#**********FOUND**********
ma=0
mi=p[0]
#**********FOUND**********
for i in range(1,9):
    if p[i]>ma:
        ma=p[i]
    if p[i]<mi:
        mi=p[i]
print("max=", ma,"min=", mi)