# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入一年份year，判断年份是否为闰年（年份能被4整除但不能被100整除，
      或者能被400整除）。
      如果是闰年，显示“是闰年”，如果不是闰年，显示“不是闰年”。

说明：年份year从键盘输入一个整数。

输出示例：

【请输入年份：】2020
2020是闰年

【请输入年份：】2018
2018不是闰年
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********







#**********  End  **********
