# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入三个整数x、y和z，计算并输出三个数中最大数m和最小数n。

说明：变量x、变量y和变量z从键盘输入，最大数使用变量m和最小数使用变量n。

输出示例：
【从键盘输入一个数x:】3
【从键盘输入另一个数y:】6
【从键盘输入另一个数z:】7
最大数：7，最小数：3 
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********






#**********  End  **********
print("最大数：%d，最小数：%d "%(m,n))