# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------
输入二个整数和加减乘除中的一个算术运算符，输出运算结果，若输入其它运算符，则
退出程序;
----------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''

while(True):
#**********FOUND**********
     x=input("输入一个整数：")
     y=int(input("输入另一个整数："))
     op=input("输入+-*/算术运算符，其它字符结束：")
     oper=('+','-','*','/')
     if  op  not in oper:
          break
#**********FOUND**********
     dict1=('+':x+y,'-':x-y,'*':x*y,'/':x/y)
     print("%s%s%s=%s"%(x,op,y,dict1.get(op)))

