# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：以下程序求100～200之内的素数。

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
import math

def sushu(start,end):
    count=0
    print("素数分别为：")
    for i in range(start,end+1):
        if(i%2==0 and i!=2):  #去除除2以外的偶数
            continue
#**********SPACE**********
        for j in range(【?】,int(math.sqrt(i))+1):          
#**********SPACE**********
            if(【?】):
                break
        else:
            count=count+1
            print(i,end=" ")
    print("")
    print("素数总数为：%d个" %count)
    return

def main():
#**********SPACE**********
    【?】
    
if __name__ == '__main__':
    main()
