# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请补充函数fun，其功能是：求出n!并将结果返回给主函数。
      完成程序后请编译并运行程序。

例如：括号内是说明
      输入：
        5   (n=5)
      输出：
        5的阶乘为120

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def fun(num):    
    factorial = 1
    if num < 0:
        print("抱歉，负数没有阶乘")
    #**********Program**********




    #**********  End  **********

def main():
    print("【请连续三次计算n!的值：】")
    for n in range(3):
        print("【第%d次：】" %(n+1))
        num = int(input("【请输入一个数字num:】 "))
        factorial = fun(num)
        print("【%d 的阶乘为 】%d" %(num,factorial))
        
if __name__ == '__main__':
    main()  
