# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目： 编写程序，从键盘输入两个整数x和y和一个运算符p（+、-）进行相应的数学运算，
       如果不是加、减号，给出错误提示。
              
输出示例： 
   
请输入第一个整数：7
请输入第二个整数：8
请输入你运算符：+
7 8 和是 15          

请输入第一个整数：7
请输入第二个整数：8
请输入你运算符：-
7 8 差是 -1

请输入第一个整数：7
请输入第二个整数：8
请输入你运算符：*
符号输入错误

------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********





#**********  End  **********
