# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，输出由1、2、3、4这四个数字组成的每位数都不相同的所有三位数

要求：每个数字用换行隔开

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def main():
    digits = (1, 2, 3, 4)
    for i in digits:
        for j in digits:
            for k in digits:
    #**********Program**********



            
    #**********  End  **********
    
if __name__ == '__main__':
    main()  
