# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------
以下程序键盘输入任意十个列表元素，升序输出：
------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
s=[]
for i in range(10):
    x=int(input("键盘输入一整数："))
#**********SPACE**********
    【?】
print("刚才输入的列表：",s)
for i in range(9):
    for j in range(i+1,10):
#**********SPACE**********
        if s[i]>s[j]: 【?】
print("升序排列后的列表：",s)