# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入两个整数x和y，计算并输出两个整数的和s，差b，积p。

说明：变量x和变量y从键盘输入，和使用变量s，差使用变量b，积使用变量p

结果示例：
【从键盘输入一个数x：】8
【从键盘输入另一个数y：】5
x和y 和：13，差：3 积：40
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********







#**********  End  **********
print("x和y 和：%d，差：%d 积：%d"%(s,b,p))