# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------
输入二个整数和加减乘除中的一个算术运算符，输出运算结果，若输入其它运算符，
则退出程序;
------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
#**********SPACE**********
while 【?】:
     x=int(input("输入一个整数："))
     y=int(input("输入另一个整数："))
     op=input("输入+-*/算术运算符，其它字符结束：")
     symbol =('+','-','*','/')
#**********SPACE**********
     if 【?】 not in symbol :
          break
     dict1={'+':x+y,'-':x-y,'*':x*y,'/':x/y}
     print("%s%s%s=%s"%(x,op,y,dict1.get(op)))