# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘接收两个整数，编写程序求出这两个整数的最大公约数和最小公倍数

提示：求最大公约数可用辗转相除法，求最小公倍数则用两个数的积除以最大公约数即可

输入输出实例：

【请输入一个整数：】6
【请输入另一个整数：】9
6和9的最大公约数是3
6和9的最大公倍数是18
------------------------------------------------------'''
def main():
    
    M=eval(input("【请输入一个整数：】"))
    N=eval(input("【请输入另一个整数：】"))
    
#**********Program**********



        
#**********  End  **********
    print("{}和{}的最大公约数是{}".format(M,N,a))
    print("{}和{}的最大公倍数是{:.0f}".format(M,N,M*N/a))
    
if __name__ == '__main__':
    main()  
