# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入圆的半径r，计算并输出圆的周长c和面积s(小数点后保留两位数字)。

说明：半径使用变量r（可以是小数）从键盘输入，周长使用变量c(保留2位小数)，
      面积使用变量s（保留2位小数）。圆周率调用math模块中pi函数。

输出示例：

【圆的半径：】3.5
圆的周长:21.99,圆的面积:38.48
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********








#**********  End  **********
print("圆的周长:%.2f,圆的面积:%.2f"%(c,s))