# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：输入一个年份，输出是否为闰年。闰年条件：能被4整除但不能被100整除，或者
      能被400整除的年份。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
a=int(input("please input year:"))
#**********FOUND**********
if a%4!=0 and a%100==0:
    print("{} is a leap year!". format(a))
#**********FOUND**********
else a%400==0:
    print("{} is a leap year!". format(a))
else:
    print("{} is not a leap year!". format(a))