# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：将一个正整数分解质因数。例如：输入90,打印出90=2*3*3*5。

---------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def main():
    x=input("输入一个正整数:")
#**********FOUND**********
    if x.isdigit() and int(x)<0:   
        x=int(x)
        t,i=1,2
        print(x,end="=")
#**********FOUND**********
        while t>0
            if x%i==0:
                print(i,end="")
                x/=i     
#**********FOUND**********
            t=x+i
            if x!=1:
                print("*",end="")
            while x%i and x!=1:
                i+=1
    else:
        print("请输入正确的正整数")

if __name__ == '__main__':
    main()
