# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：利用for循环求1～100中所有的奇数和偶数的和分别是多少。

------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''

sum_odd = 0
sum_even = 0
#**********SPACE**********
for i in【?】:
#**********SPACE**********
     if 【?】:                     # i为奇数                 
        sum_odd = sum_odd + i
     else:                          # i为偶数
        sum_even = sum_even + i
print("Odd sum is ", sum_odd)
print("Even sum is ", sum_even)

