# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：阅读以下程序并填空，该程序是求阶乘的累加和。
      S=0!+1!+2!+.........+n!

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
def cal(n):
    pro=1
#**********SPACE**********
    for i in range(【?】):
#**********SPACE**********
        pro=【?】
    return pro

def main():
    n=int(input("请输入一个正整型数值n:"))
    s=0
#**********SPACE**********
    for i in range(0,【?】):
        if i!=n:
            print("%d! + "%i,end='')
        else:
            print("%d! = "%i,end='')
#**********SPACE**********
        s=【?】
    print(s)
    
if __name__ == '__main__':
    main()
