# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学
      用A表示，60-89分之间的用B表示，60分以下的用C表示。

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
------------------------------------------------------'''
def main():
    score = int(input('输入分数:\n'))
#**********SPACE**********
    if score 【?】 90:
        grade = 'A'
    elif score >= 60:
#**********SPACE**********
        grade = 【?】
#**********SPACE**********
    【?】
        grade = 'C'
     
#**********SPACE**********
    print('%d 属于 %s' % (score,【?】))
            
if __name__ == '__main__':
    main()
