# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入三条边（a,b,c都为整数） ，判断是否能够构成一个三角形，
      如果能，则提示可以构成三角形；如果不能，则提示不能构成三角形。
     （组成三角形的条件是任意两边之和大于第三边）

输出示例：

【请输入第一条边：】5
【请输入第二条边：】6
【请输入第三条边：】7
5 6 7 可以构成一个三角形 

【请输入第一条边：】1
【请输入第二条边：】2
【请输入第三条边：】4
1 2 4 不可以构成一个三角形 
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********







#**********  End  **********
