# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：平均成绩

描述：编写程序，从键盘输入语文、数学、英语三门功课的成绩，计算并输出平均成绩，要求平均成绩保留1位小数。

要求：输出时，采用格式输出方式控制小数点位数。

     输入格式：依次输入三个数字作为三门功课成绩。

     输出格式：输出三门功课的平均成绩，结果保留1位小数。


      输入示例    输出示例

 示例   70        您的平均成绩为82.8
        88.5
        90
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********





#**********  End  **********
