# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：警察抓了A、B、C、D四个偷窃嫌疑犯，其中只有一个人是真正的小偷，审问记录如下： A说："我不是小偷。" B说："C是小偷。" C说："小偷肯定是D。" D说："C在冤枉人。" 已知四个人中有三个人说的是真话，一个人说的是假话。请问到底谁是小偷？------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。

------------------------------------------------------'''
suspects=['A','B','C','D']
#**********SPACE**********
for  x  in【?】:
    if (x!='A') + (x=='C') + (x=='D') + (x!='D')==3:
        print("\nThe thief is:",x)
#**********SPACE**********
          【?】       
