# -*- coding:cp936 -*-
'''---------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------

程序功能为：输入2个正整数x、y，输出以x为最大公约数、以y为最小公倍数的正整
数对的数量。例如：以3和60为最大公约数和最小公倍数的整数对有（3，60）、（15，12）、
（12，15）和（60，3），共计4对。运行样例见样张图片。
思路：枚举区间[x, y]内所有整数对(p, q)，如果p和q的最大公约数为x、且p和q的乘
积除以x等于y，则(p, q)为一个满足条件的整数对。
下面的程序中有三处代码不完整，请填写完整。

-----------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序的其他部分。
---------------------------------------------------------------------'''

def isprime(m, n):  # 判断整数m和n是否互质
    for i in range(2, min(m, n)+1):
        if m % i == 0 and n % i == 0:
            return False
    #**********SPACE**********
    【?】
def getcnt(x, y):
    #**********SPACE**********
    【?】
    for p in range(x, y+1, x):
        for q in range(x, y+1, x):
    #**********SPACE**********
          【?】
                cnt += 1
    return cnt

if __name__ == '__main__':
    x, y = eval(input('Enter 2 positive integers x and y (x <= y): '))
    print(getcnt(x, y))
