# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入某同学语文成绩chinese，数学成绩math（可以是小数），
      计算并输出总成绩sum 和平均成绩avg，小数点后保留一位。

说明：语文成绩使用变量chinese，数学成绩使用变量math（可以是小数）从键盘输入，
      总成绩使用变量sum，平均成绩使用变量avg。

输出示例：
【从键盘输入语文成绩：】50
【从键盘输入数学成绩：】80
总成绩:130.0,平均成绩:65.0
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********






#**********  End  **********
print("总成绩:%.1f,平均成绩:%.1f"%(sum,avg))