# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：分别输入两个整数以及一个加减乘除中的算术运算符，输出运算结果，
      若输入其它运算符，则退出程序;

例如：输出格式如下
【输入一个整数：】1
【输入另一个整数：】2
【输入+-*/算术运算符，其它字符结束：】+
1+2=3
【输入一个整数：】3
【输入另一个整数：】4
【输入+-*/算术运算符，其它字符结束：】-
3-4=-1
【输入一个整数：】5
【输入另一个整数：】6
【输入+-*/算术运算符，其它字符结束：】*
5*6=30
【输入一个整数：】7
【输入另一个整数：】8
【输入+-*/算术运算符，其它字符结束：】/
7/8=0.875
【输入一个整数：】9
【输入另一个整数：】0
【输入+-*/算术运算符，其它字符结束：】=
>>> 

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def main():
    while True:
        x=int(input("【输入一个整数：】"))
        y=int(input("【输入另一个整数：】"))
        op=input("【输入+-*/算术运算符，其它字符结束：】")
    #********** Program **********
    

        

    #********** End **********    
        
        
if __name__ == '__main__':
    main() 
