# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------
以下程序键盘输入任意十个列表元素，升序输出：
----------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''

#**********FOUND**********
s=()
for i in range(10):
    x=int(input("键盘输入一整数："))
    s.append(x)
print("刚才输入的列表：",s)
#**********FOUND**********
for i in range(10):
    for j in range(i+1,10):
        if s[i]>s[j]: s[i],s[j]=s[j],s[i]
print("升序排列后的列表：",s)
