# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：还有多少个鸡蛋

描述：有一筐鸡蛋,1个1个拿，正好拿完；2个2个拿，还剩1个；3个3个拿，正好拿完；4个4个拿，还剩1个；5个5个拿，还差1个；6个6个拿，还剩3个；7个7个拿，正好拿完；8个8个拿，还剩1个；9个9个拿，正好拿完。问筐里最少有多少鸡蛋？

要求：编写程序，输出剩余鸡蛋的个数。

     输入格式：该题无输入。


     输出格式：如样例所示。


     输出示例
     还有 ? 个鸡蛋
---------------------------------------------------------
注意：仅在注释标志之间填入所编写语句。
------------------------------------------------------'''

#**********Program**********





#**********  End  **********
