# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入爸爸年龄dad，儿子年龄son，计算父子的年龄差距diff并输出。

说明：爸爸年龄使用变量dad，儿子年龄使用变量son都是整数从键盘输入，
      年龄差距使用变量diff。

输出示例：
【从键盘输入爸爸年龄：】35
【从键盘输入儿子年龄：】5
父子年龄差距离： 30
---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********






#**********  End  **********
print("父子年龄差距离：",diff)