# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从键盘输入一个人姓名name和计算机成绩score（整数），判断这个人是否及格
    （成绩大于等于60合格）。

说明：姓名name和计算机成绩score（整数）从键盘输入。

输出示例：

【请输入姓名：】Jack
【请输入成绩：】70
Jack合格 

【请输入姓名：】Aaron
【请输入成绩：】45
Aaron不合格
------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
#**********Program**********







#**********  End  **********
