# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：本程序编写了多个函数, 当输入 n 为偶数时, 调用函数求 l/2+1/4+…+l/n; 
      当输入n为奇数时, 调用函数求1/1+1/3+…+1/n。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def peven(n):
    s = 0
#**********FOUND**********
    for i in range(2,n+1):
        s += 1/i
    return s
def podd(n):
    s = 0
    for i in range(1, n+1,2):
        s += 1/i
    return s
def dcall(fp,n):
#**********FOUND**********
    s = peven (n)
    return s
n = int(input('input a number:\n'))
if n % 2 == 0:
    sum = dcall(peven,n)
else:
    sum = dcall(podd,n)
print(sum)