# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：计算正整数num的各位上的数字之积。

例如：输入252，则输出应该是20。

---------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
def fun(num):
    k=1
    while(num):
#**********FOUND**********
        k=num%10
#**********FOUND**********
        num=num/10
#**********FOUND**********
    return num

def main():
    n=int(input("请输入一个正整数n："))
    print("各位上的数字之积为：",fun(n))

if __name__ == '__main__':
    main()
