# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：将列表中的元素按照逆序重新存放(用循环结构实现)。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
n=int(input('输入数据个数:'))
x=[]
for i in range(n):
    a=int(input('输入一个数:'))
    x. append(a)
#**********FOUND**********
for i in range(n/2):
#**********FOUND**********
    x[i],x[n-i]=x[n-i],x[i]
print('逆序为:',x)