# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写函数fun，该函数的功能是：判断5位的字符串是否是回文。
     
例如：abcdcba是回文。abcdefg不是回文。

---------------------------------------------------------
注意：部分源程序给出如下。请勿改动主函数main和其它函数中的
      任何内容，仅在函数的注释标志之间填入所编写的若干语句。
------------------------------------------------------'''
def fun(s):
    #**********Program**********



    #**********  End  **********

def main():
    print("【请连续四次次判断输入字符串是否是回文：】")
    for n in range(4):
        print("【第%d次：】" %(n+1))
        s=input("【请输入一个5位字符:】")
        while True:
            if len(s)!=5:
                s=input("【输入错误，请重新输入:】")
            else:
                if fun(s):
                    print("%s是【回文数】" % s)
                else:
                    print("%s不是【回文数】" % s)
                break

if __name__ == '__main__':
    main()         
