# -*- coding:cp936 -*-
'''------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：若一个数恰好等于它的真因子之和，则这个数称为完数。例如，6的真因子为1、2、3，
      而6=1+2+3，因此6是完数。编写程序找出1000之内的所有完数，并输出其因子。
------------------------------------------------------------
注意：不可以增加或删除程序行，也不可以更改程序的结构。
------------------------------------------------------'''
for i in range(1,1001):
#**********FOUND**********
    s = 1
    for j in range(1,i):
#**********FOUND**********
        if i//j==0:
            s=s+j
        if s==i:
            print('{} its factors are '. format(i), end='')
#**********FOUND**********
            for j in range(i):
                if i % j == 0:
                    print(j, end=' ')
            print()