/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：给定程序的功能是:求二分之一的圆面积,函数通过形参得到圆的半径,函数返回二
分之一的圆面积（注：圆面积公式为: 2，在程序中定义的变量名要与公式的变量相同)。 
例如：输入圆的半径值：19.527,输出为:s=598.949991。 
注意：部分源程序给出如下。 
-------------------------------------------------------*/
#include <stdio.h>
void main()
{        
        double x;
        printf("Enter x: ");
/***********SPACE***********/
        scanf("%lf", 【?】 );    
/***********SPACE***********/
        printf("s=%lf\n",3.14159* 【?】/2.0); 
 }