/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
功能：从键盘上输入若干个学生的成绩，统计并输出最高成绩和最
      低成绩，当输入负数时结束输入。
---------------------------------------------------------*/
#include <stdio.h>
main()
{
    /***********SPACE***********/
    int x,【?】,min;
    printf("please input x:\n");
    /***********SPACE***********/
    scanf("%d",【?】); 
    max=x;
    min=x;
    /***********SPACE***********/
    while(【?】)
        {
             if(x>max)
    /***********SPACE***********/
                     【?】;
             if(x<min) 
                     min=x;
    /***********SPACE***********/
             【?】("%d",&x);
        }
    printf("max=%d,min=%d\n",max,min);
}