/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：使用指向变量的指针编写交换两个变量值函数，按主调函数的调用形式编写。
-------------------------------------------------------*/
void swap();
void main()
{  int x,y;
   printf("输入两个整数 x,y \n");
   scanf("%d%d",&x,&y);
   swap(&x,&y);
   printf("x=%dy=%d",x,y);  }
void swap( int *p , int *q  )
{  int t;
   t=*p;
/***********SPACE***********/
       【?】; 
/***********SPACE***********/
       【?】 ;  }