/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
说明：下面程序的功能是打印出所有的“水仙花数”，请填写
      程序所缺内容。
注：水仙花数是指一个三位数的各位数字的立方和是这个数本身。
-------------------------------------------------------*/
#include"stdio.h"
void  f( int n)
{ 
  int i,j,k;
  i=n/100;
  /***********SPACE***********/
  j=【?】;
  k=n%10;
  /***********SPACE***********/
  if(【?】) 
  {
    printf("%5d\n",n);
  }
}
void main()
{
  void f(int n);
  int i;
  for(i=100;i<1000;i++)
   f(i);
}