/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：输入一个正整数repeat (0<repeat<10)，做repeat次下列运算：
      输入一个正整数 n，计算1－2/3＋3/5－4/7＋5/9-6/11+……的前n项之和，
      输出时保留3位小数。
输入输出示例：括号内是说明
输入
3        (repeat=3)
1        (n=1)
3        (n=3)
5        (n=5)
输出
sum = 1.000
sum = 0.933
sum = 0.917
-------------------------------------------------------*/
#include <stdio.h>
void  main( )
{
    int flag, i, n;
    int repeat, ri;
    double item, sum;
    scanf("%d", &repeat);
    for(ri = 1; ri <= repeat; ri++)
    {
        scanf("%d", &n);
        /**********Program**********/
       //只能用上述已定义的变量，如循环变量用变量i，正负符号用变量flag，
       //求和项用变量item等等
       //循环用for
        /**********  End  **********/
              printf("sum = %.3f\n", sum);
    }
}