/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：请编写函数fun，该函数的功能是：计算并输出n(包括n)以内所有能被5或9整除的
      自然数的倒数之和。
例如：若主函数中从键盘给n输入20后，则输出为S＝ 0.583333。
注意：n的值要求不大于100。。
      请勿改动主函数main和其他函数中的任何内容，仅在函数fun的花括号中填入
      你编写的若干语句。
-------------------------------------------------------*/
#include <stdio.h>
double fun(int n)
{
/**********Program**********/
/**********  End  **********/
}
void main()
{
        int n;
        double s;
        printf("\nInput n:");
        scanf("%d",&n);
        s=fun(n);
        printf("\n\ns=%f\n",s);
}