/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------
【训练2.1】下面的程序可以把摄氏温度c 转化为华氏温度f，转化公式为 f=9/5*c+32，
           程序中有3处错误，请改正错误后运行正确的程序。
  运行结果：如图所示。  
------------------------------------------------------*/
#include <stdio.h>
int main(void)
{   
    double c=0,f=0;
/***********FOUND***********/
    print("Input c:")   
/***********FOUND***********/
    scanf("%lf",c);      
/***********FOUND***********/
    f=9/5*c+32;         
    printf("c=%lf,f=%lf\n",c,f);  
    return 0;
}