/*------------------------------------------------------    
【程序改错】
--------------------------------------------------------
功能：一个5位数，判断它是不是回文数。即12321是回文数，个
      位与万位相同，十位与千位相同。
------------------------------------------------------*/
#include<stdio.h>
main( )
{
  /**********FOUND**********/
  long ge,shi,qian;wan,x;
  scanf("%ld",&x);
  /**********FOUND**********/
  wan=x%10000;
  qian=x%10000/1000;
  shi=x%100/10;
  ge=x%10;
  /**********FOUND**********/
  if (ge==wan||shi==qian)
    printf("this number is a huiwen\n");
  else
    printf("this number is not a huiwen\n");
}