/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：编程从键盘输入一个字符串和一个字符，统计该字符串中指定字符出现的次数。
-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
void main()
{        
        char str[100],c;
        int i=0,count=0;
        printf("请输入一个字符串：");
        gets(str);
        printf("请输入指定的查找字符：");
        scanf("%c",&c);
       /**********Program**********/
       /**********  End  **********/
        printf("%d\n",count);
}