/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：编程将字符数组s2中的全部字符拷贝到字符数组s1中。
要求：不能调用字符串库函数strcpy()。
-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#define N 80
void main()
{
         int i;
         char s1[N];
         char s2[N];
        scanf("%s",s2);
       /**********Program**********/
       /**********  End  **********/
         printf("%s",s1);
}