/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：下列给定程序中，函数fun的功能是：找出100～999之间(含100和999)所有整数中各
     位上数字之和为x(x为正整数)的整数，并输出；符合条件的整数个数作为函数值返回。
例如：当x值为5时，100～999之间各位上数字之和为5的整数有：104、113、122、131、
      140、203、212、221、230、302、311、320、401、410、500，共有15个。
      当x值为27时，各位数字之和为27的整数是：999，只有1个。
-------------------------------------------------------*/
#include  <stdio.h>
int fun(int  x)
{ 
        int  n, s1, s2, s3, t;
        n=0;
        t=100;
/***********SPACE***********/
        while(t<=【?】)
        {
                s1=t%10;
/***********SPACE***********/
                s2=(【?】)%10; 
                s3=t/100;
/***********SPACE***********/
                if(s1+s2+s3==【?】)
                { 
                        printf("%d ",t);
                        n++;
                }
                t++;
        }
        return  n;
}
main()
{ 
        int x=-1;
        while(x<0)
        {
                printf("Please input(x>0): "); 
                scanf("%d",&x);
        }
        printf("\nThe result is: %d\n",fun(x));
}