/*------------------------------------------------
【程序设计】
--------------------------------------------------
功能：编写函数fun求sum=d+dd+ddd+……+dd...d(n个d)，
      其中d为1-9的数字。
例如：3+33+333+3333+33333(此时d=3,n=5)，d和n在主函
      数中输入。
------------------------------------------------*/
#include <stdio.h>
long int fun(int d,int n)
{
  /**********Program**********/
  /**********  End  **********/
}
main()
{ 
  int d,n;
  long sum,fun();
  printf("d=");
  scanf("%d",&d);
  printf("n=");
  scanf("%d",&n);
  sum=fun(d,n);
  printf("sum=%ld\n",sum);
}