/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
功能：计算并输出high以内最大的10个素数之和，high由主函数传
给fun函数，若high的值为100，则函数的值为732。
-------------------------------------------------------*/
#include <conio.h>
#include <stdio.h>
#include <math.h>
int fun( int  high )
{
int sum = 0,  n=0,  j,  yes;
/***********SPACE***********/
while ((high >= 2) && (【?】))
{
yes = 1;
for (j=2; j<=high/2; j++ )
/***********SPACE***********/
if (【?】)
{
yes=0;
break;
}
if (yes)
{
sum +=high;
n++;
}
high--;
}
/***********SPACE***********/
【?】;
}
main ( )
{
printf("%d\n", fun (100));
}