/*------------------------------------------------------        
【程序改错】
--------------------------------------------------------
功能：先从键盘上输入一个3行3列矩阵的各个元素的值，然后输
      出主对角线上的元素之和sum。
------------------------------------------------------*/
#include <stdio.h>
void fun()
{
  int a[3][3],sum;
  int i,j;
  /**********FOUND**********/
  a=0;
  for(i=0;i<3;i++)
    for(j=0;j<3;j++)
      /**********FOUND**********/
      scanf("%d",a[i][j]);
  for(i=0;i<3;i++)
    /**********FOUND**********/
    sum=sum+a[i][j];
    /**********FOUND**********/
  printf("sum=%f\n",sum);
}
main()
{
  fun();
}