/*------------------------------------------------
【程序改错】
--------------------------------------------------
功能：编写函数fun,求两个整数的最小公倍数，然后用主
      函数main()调用这个函数并输出结果，两个整数由
      键盘输入。
------------------------------------------------*/
#include <stdio.h>
int fun(int m,int n)
{
  int i;
  /**********FOUND**********/
  if (m=n)
  {
    i=m;
    m=n;
    n=i;
  }
  for(i=m;i<=m*n;i+=m)
    /**********FOUND**********/
    if(i%n==1)
      return(i);
  return 0;
}
main()
{
  unsigned int m,n,q;
  printf("m,n=");
  scanf("%d,%d",&m,&n);
  /**********FOUND**********/
  q==fun(m,n);
  printf("p(%d,%d)=%d",m,n,q);
}